In [1]:
from tkinter.constants import FIRST

import numpy as np
import pandas as pd
from tornado.web import url

record1 = pd.Series({'Name': 'Alice', 'Class': 'Physics', 'Score': 85})
record2 = pd.Series({'Name': 'Jack', 'Class': 'Chemistry', 'Score': 82})
record3 = pd.Series({'Name': 'Helen', 'Class': 'Biology', 'Score': 90})

df = pd.DataFrame([record1, record2, record3], index=['school1', 'school2', 'school1'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [ ]:
students = [
    {'Name': 'Alice', 'Class': 'Physics', 'Score': 85}
    {'Name': 'Jack', 'Class': 'Chemistry', 'Score': 82}
]

In [2]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [7]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [10]:
df.loc['school1']['Score']

school1    85
school1    90
Name: Score, dtype: int64

In [ ]:
df.loc['Name','Score']

##DF indexing and Loading

In [12]:
df = pd.read_csv("mpg.csv")
df.head()

,Unnamed: 0,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
0,1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [13]:
df = pd.read_csv("mpg.csv", index_col=0)
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [16]:
new_df = df.rename(columns= {'year': 'Év', 'cyl': 'Henger'})
new_df.head()

,manufacturer,model,displ,Év,Henger,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [17]:
new_df = new_df.rename(mapper=str.strip, axis='columns')
new_df.head()
#oszlopnevkeben es elejen hatujan kivenni a space helyeket

,manufacturer,model,displ,Év,Henger,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact

In [18]:
cols = list(df.columns)

cols = (x.lower().strip() for x in cols)

df.columns = cols
df.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

##DF Querying

In [19]:
admit_mask = df['cty'] < 19
admit_mask

1       True
2      False
3      False
4      False
5       True
       ...
230    False
231    False
232     True
233     True
234     True
Name: cty, Length: 234, dtype: bool

In [22]:
df.where(admit_mask).dropna().head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999.0,4.0,auto(l5),f,18.0,29.0,p,compact
5,audi,a4,2.8,1999.0,6.0,auto(l5),f,16.0,26.0,p,compact
6,audi,a4,2.8,1999.0,6.0,manual(m5),f,18.0,26.0,p,compact
7,audi,a4,3.1,2008.0,6.0,auto(av),f,18.0,27.0,p,compact
8,audi,a4 quattro,1.8,1999.0,4.0,manual(m5),4,18.0,26.0,p,compact

In [23]:
df.where(admit_mask).head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999.0,4.0,auto(l5),f,18.0,29.0,p,compact
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,audi,a4,2.8,1999.0,6.0,auto(l5),f,16.0,26.0,p,compact

In [24]:
df[df['cty'] < 19].head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
6,audi,a4,2.8,1999,6,manual(m5),f,18,26,p,compact
7,audi,a4,3.1,2008,6,auto(av),f,18,27,p,compact
8,audi,a4 quattro,1.8,1999,4,manual(m5),4,18,26,p,compact

In [25]:
(df['cty'] < 19) & (df['cty'] > 17)

1       True
2      False
3      False
4      False
5      False
       ...
230    False
231    False
232    False
233     True
234    False
Name: cty, Length: 234, dtype: bool

In [28]:
df['cty'].gt(19) & df['cty'].lt(17)

1      False
2      False
3      False
4      False
5      False
       ...
230    False
231    False
232    False
233    False
234    False
Name: cty, Length: 234, dtype: bool

In [29]:
df['cty'].gt(19).lt(17)
#nem jo mert elosszor leszuri az egyiket majd utana meg a masikat

1      True
2      True
3      True
4      True
5      True
       ...
230    True
231    True
232    True
233    True
234    True
Name: cty, Length: 234, dtype: bool

## Indexing Data Frame

In [30]:
kf = pd.read_csv("predict.csv", index_col=0)
kf.head()

,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,
1,337,118,4,4.5,4.5,9.65,1,0.92
2,324,107,4,4.0,4.5,8.87,1,0.76
3,316,104,3,3.0,3.5,8.00,1,0.72
4,322,110,3,3.5,2.5,8.67,1,0.80
5,314,103,2,2.0,3.0,8.21,0,0.65

In [31]:
kf = kf.set_index('SOP')
kf.head()
# atrakja za indexelo oszlopot

,GRE Score,TOEFL Score,University Rating,LOR,CGPA,Research,Chance of Admit
SOP,,,,,,,
4.5,337,118,4,4.5,9.65,1,0.92
4.0,324,107,4,4.5,8.87,1,0.76
3.0,316,104,3,3.5,8.00,1,0.72
3.5,322,110,3,2.5,8.67,1,0.80
2.0,314,103,2,3.0,8.21,0,0.65

In [32]:
kf = kf.reset_index()
kf.head()

,SOP,GRE Score,TOEFL Score,University Rating,LOR,CGPA,Research,Chance of Admit
0,4.5,337,118,4,4.5,9.65,1,0.92
1,4.0,324,107,4,4.5,8.87,1,0.76
2,3.0,316,104,3,3.5,8.00,1,0.72
3,3.5,322,110,3,2.5,8.67,1,0.80
4,2.0,314,103,2,3.0,8.21,0,0.65

In [36]:
df = pd.read_csv("census.csv")
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [37]:
df['SUMLEV'].unique()

array([40, 50])

In [39]:
df = df[df['SUMLEV'] == 50]
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [41]:
colums_to_keep = ['STNAME', 'CTYNAME', 'BIRTHS2021', 'BIRTHS2011']

df = df[colums_to_keep]
df.head()

KeyError: "['BIRTHS2021'] not in index"

## DF with Missing values

In [43]:
df = pd.read_csv("class_grades.csv")
df.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17      NaN     63.15  48.89
3       7         NaN       NaN    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [44]:
mask = df.isnull()
mask

    Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0    False       False     False    False     False  False
1    False       False     False    False     False  False
2    False       False     False     True     False  False
3    False        True      True    False     False  False
4    False       False     False    False     False  False
..     ...         ...       ...      ...       ...    ...
94   False        True     False    False     False  False
95   False        True     False    False     False  False
96   False       False     False    False     False  False
97   False       False     False    False     False  False
98   False       False     False    False     False  False

[99 rows x 6 columns]

In [45]:
df.fillna(0, inplace=True)
df.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17     0.00     63.15  48.89
3       7        0.00      0.00    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [47]:
df = pd.read_csv('log.csv')
df.head(20)

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6    NaN     NaN
2   1469974544  cheryl     intro.html                  9    NaN     NaN
3   1469974574  cheryl     intro.html                 10    NaN     NaN
4   1469977514     bob     intro.html                  1    NaN     NaN
5   1469977544     bob     intro.html                  1    NaN     NaN
6   1469977574     bob     intro.html                  1    NaN     NaN
7   1469977604     bob     intro.html                  1    NaN     NaN
8   1469974604  cheryl     intro.html                 11    NaN     NaN
9   1469974694  cheryl     intro.html                 14    NaN     NaN
10  1469974724  cheryl     intro.html                 15    NaN     NaN
11  1469974454     sue  advanced.html                 24    NaN     NaN
12  1469974524     sue  advanced.html                 25    NaN     NaN
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26    NaN     NaN
15  1469974624     sue  advanced.html                 27    NaN     NaN
16  1469974654     sue  advanced.html                 28    NaN     5.0
17  1469974724     sue  advanced.html                 29    NaN     NaN
18  1469974484  cheryl     intro.html                  7    NaN     NaN
19  1469974514  cheryl     intro.html                  8    NaN     NaN

In [49]:
df = df.ffill()
df.head(20)

          time    user          video  playback position paused  volume
0   1469974424  cheryl     intro.html                  5  False    10.0
1   1469974454  cheryl     intro.html                  6  False    10.0
2   1469974544  cheryl     intro.html                  9  False    10.0
3   1469974574  cheryl     intro.html                 10  False    10.0
4   1469977514     bob     intro.html                  1  False    10.0
5   1469977544     bob     intro.html                  1  False    10.0
6   1469977574     bob     intro.html                  1  False    10.0
7   1469977604     bob     intro.html                  1  False    10.0
8   1469974604  cheryl     intro.html                 11  False    10.0
9   1469974694  cheryl     intro.html                 14  False    10.0
10  1469974724  cheryl     intro.html                 15  False    10.0
11  1469974454     sue  advanced.html                 24  False    10.0
12  1469974524     sue  advanced.html                 25  False    10.0
13  1469974424     sue  advanced.html                 23  False    10.0
14  1469974554     sue  advanced.html                 26  False    10.0
15  1469974624     sue  advanced.html                 27  False    10.0
16  1469974654     sue  advanced.html                 28  False     5.0
17  1469974724     sue  advanced.html                 29  False     5.0
18  1469974484  cheryl     intro.html                  7  False     5.0
19  1469974514  cheryl     intro.html                  8  False     5.0

In [51]:
df = df.dfill().head(20)

AttributeError: 'DataFrame' object has no attribute 'dfill'

In [ ]:
df = pd.DataFrame({'A':[1,2,2,3]
                  'B': [3,6,3,7,8]
})

## DF manipulating Example

In [52]:
df = pd.read_csv('presidents.csv')
df.head()

,#,President,Born,Age atstart of presidency,Age atend of presidency,Post-presidencytimespan,Died,Age
0,1,George Washington,"Feb 22, 1732[a]","57 years, 67 daysApr 30, 1789","65 years, 10 daysMar 4, 1797","2 years, 285 days","Dec 14, 1799","67 years, 295 days"
1,2,John Adams,"Oct 30, 1735[a]","61 years, 125 daysMar 4, 1797","65 years, 125 daysMar 4, 1801","25 years, 122 days","Jul 4, 1826","90 years, 247 days"
2,3,Thomas Jefferson,"Apr 13, 1743[a]","57 years, 325 daysMar 4, 1801","65 years, 325 daysMar 4, 1809","17 years, 122 days","Jul 4, 1826","83 years, 82 days"
3,4,James Madison,"Mar 16, 1751[a]","57 years, 353 daysMar 4, 1809","65 years, 353 daysMar 4, 1817","19 years, 116 days","Jun 28, 1836","85 years, 104 days"
4,5,James Monroe,"Apr 28, 1758","58 years, 310 daysMar 4, 1817","66 years, 310 daysMar 4, 1825","6 years, 122 days","Jul 4, 1831","73 years, 67 days"

In [53]:
df['First'] = df['President']
df['First'] = df['First'].replace("[].*","", regex=True)
df.head()

PatternError: unterminated character set at position 0

pip install lxml

In [ ]:
url =